DataProcessors/СЛ_Мониторинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СЛ_Мониторинг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФильтрСобытие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрУровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СЛ_Уровни</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрОбъектЛимита</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрКатегорияЛимит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрЛимитЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрСуммаДокументаЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПревышениеЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/СЛ_Мониторинг/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФильтрУровеньПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСобытиеПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПользовательПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОбъектПриИзменении(Элемент)
	ОбновитьСписокНаСервере(); 
КонецПроцедуры   

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокНаСервере();
	КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокНаСервере()
	СписокСобытий.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ФильтрОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Объект", Объект.ФильтрОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрПользователь) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Пользователь", Объект.ФильтрПользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрСобытие) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Событие", Объект.ФильтрСобытие);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФильтрУровень) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокСобытий.Отбор, "Уровень", Объект.ФильтрУровень);
	КонецЕсли;
	
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрОбъектЛимитаПриИзменении(Элемент)
		 ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрЛимитЛимитПриИзменении(Элемент)
		 ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрКатегорияЛимитПриИзменении(Элемент)
		ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры

&НаКлиенте
	Процедура ОбъектФильтрСуммаДокументаЛимитПриИзменении(Элемент)
		ОбновитьСписокЛимитНаСервере();
	КонецПроцедуры  

&НаКлиенте
Процедура ОбъектФильтрПревышениеЛимитПриИзменении(Элемент)
	ОбновитьСписокЛимитНаСервере();
КонецПроцедуры
	
	
&НаСервере
Процедура  ОбновитьСписокЛимитНаСервере()
	    СписокЛимитов.Отбор.Элементы.Очистить();
	    Если ЗначениеЗаполнено(Объект.ФильтрОбъектЛимита) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЛимитов.Отбор, "Объект", Объект.ФильтрОбъектЛимита);
	 КонецЕсли;
	 Если ЗначениеЗаполнено(Объект.ФильтрКатегорияЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокЛимитов.Отбор, "Категория", Объект.ФильтрКатегорияЛимит);
	 КонецЕсли; 
	 Если ЗначениеЗаполнено(Объект.ФильтрЛимитЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "Лимит", 
            Объект.ФильтрЛимитЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
	   Если ЗначениеЗаполнено(Объект.ФильтрСуммаДокументаЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "СуммаДокумента", 
            Объект.ФильтрСуммаДокументаЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
	  Если ЗначениеЗаполнено(Объект.ФильтрПревышениеЛимит) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
            СписокЛимитов.Отбор, 
            "Превышение", 
            Объект.ФильтрПревышениеЛимит, 
            ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	  КонецЕсли;
КонецПроцедуры
